In [1]:
import pandas as pd
import numpy as np

In [2]:
fuel = pd.read_csv("dane/course-files/fuel.csv", usecols=['Year','Make','Model','Range (FT1)','City Range (FT1)'])
fuel.head()

   Year        Make               Model  Range (FT1)  City Range (FT1)
0  1984  Alfa Romeo           GT V6 2.5          0.0               0.0
1  1984  Alfa Romeo           GT V6 2.5          0.0               0.0
2  1984  Alfa Romeo  Spider Veloce 2000          0.0               0.0
3  1984  Alfa Romeo  Spider Veloce 2000          0.0               0.0
4  1984  AM General   DJ Po Vehicle 2WD          0.0               0.0

In [3]:
fuel.set_index(["Year", "Make", "Model"], inplace=True)
fuel.head()

                                    Range (FT1)  City Range (FT1)
Year Make       Model
1984 Alfa Romeo GT V6 2.5                   0.0               0.0
                GT V6 2.5                   0.0               0.0
                Spider Veloce 2000          0.0               0.0
                Spider Veloce 2000          0.0               0.0
     AM General DJ Po Vehicle 2WD           0.0               0.0

In [4]:
fuel.sort_index(inplace=True)
fuel.head()

                                   Range (FT1)  City Range (FT1)
Year Make       Model
1984 AM General DJ Po Vehicle 2WD          0.0               0.0
                DJ Po Vehicle 2WD          0.0               0.0
                FJ8c Post Office           0.0               0.0
                FJ8c Post Office           0.0               0.0
     Alfa Romeo GT V6 2.5                  0.0               0.0

In [5]:
print(fuel.loc[(1984, "Alfa Romeo", "Spider Veloce 2000")])

Range (FT1)  City Range (FT1)
Year Make       Model
1984 Alfa Romeo Spider Veloce 2000          0.0               0.0
                Spider Veloce 2000          0.0               0.0

In [6]:
fuel = fuel.swaplevel(i = 0, j = 1)
fuel.sort_index(inplace = True)
fuel.head(10)

                                           Range (FT1)  City Range (FT1)
Make             Year Model
AM General       1984 DJ Po Vehicle 2WD            0.0               0.0
                      DJ Po Vehicle 2WD            0.0               0.0
                      FJ8c Post Office             0.0               0.0
                      FJ8c Post Office             0.0               0.0
                 1985 Post Office DJ5 2WD          0.0               0.0
                      Post Office DJ8 2WD          0.0               0.0
ASC Incorporated 1987 GNX                          0.0               0.0
Acura            1986 Integra                      0.0               0.0
                      Integra                      0.0               0.0
                      Legend                       0.0               0.0

In [7]:
fuel.loc[("Alfa Romeo", 1984, "Spider Veloce 2000")]

                                    Range (FT1)  City Range (FT1)
Make       Year Model
Alfa Romeo 1984 Spider Veloce 2000          0.0               0.0
                Spider Veloce 2000          0.0               0.0

In [8]:
fuel = fuel.swaplevel(i = 1, j = 2)
fuel.sort_index(inplace = True)
fuel.head(10)

                                           Range (FT1)  City Range (FT1)
Make             Model               Year
AM General       DJ Po Vehicle 2WD   1984          0.0               0.0
                                     1984          0.0               0.0
                 FJ8c Post Office    1984          0.0               0.0
                                     1984          0.0               0.0
                 Post Office DJ5 2WD 1985          0.0               0.0
                 Post Office DJ8 2WD 1985          0.0               0.0
ASC Incorporated GNX                 1987          0.0               0.0
Acura            2.2CL/3.0CL         1997          0.0               0.0
                                     1997          0.0               0.0
                                     1997          0.0               0.0

In [9]:
fuel.loc[("Alfa Romeo", "Spider Veloce 2000", 1984)]

                                    Range (FT1)  City Range (FT1)
Make       Model              Year
Alfa Romeo Spider Veloce 2000 1984          0.0               0.0
                              1984          0.0               0.0